doc: adding documentation in Architecture.md
